admin/app/Controllers/Customers.php

SELECT *
FROM `brands`
ORDER BY `BrandID` DESC
---
    public function all_brands()
    {
        $data['all_brands_data'] = $this->brand->orderby('BrandID','DESC')->findAll();