admin/app/Controllers/Home.php

SELECT *
FROM `orders`
WHERE DATE(Created_at) = '2025-08-28'
ORDER BY `OrderID` DESC
 LIMIT 5
SELECT *
FROM `blog`
SELECT *
FROM `all_settings`
 LIMIT 1
SELECT *
FROM `enquiries`
SELECT *
FROM `products`
SELECT *
FROM `users`
WHERE `UserType` = 2
---
public function index()
{
    $data_arr=[];

    // $all_trans_data = $this->order_modal->orderBy('OrderID','DESC')->get()->getResult('array');

    $today = date('Y-m-d');

    $all_trans_data = $this->order_modal
                        ->where('DATE(Created_at)', $today)
                        ->orderBy('OrderID', 'DESC')
                         ->limit(5)
                        ->find();

    $data['today_order'] =  $all_trans_data;

    // echo '<pre>';
    // print_r( $data['today_order']);die;


    //  $data['all_products'] = $this->product_model->findAll();
    //  print_r($data['all_products']);
    //  die;
    $blog_data =$this->BlogModel->findAll();

    $currency_symbol =$this->Allsettingsmodel->first();

    $EnquiryModel_data=$this->EnquiryModel->findAll();

    $product_data=$this->product_model->findAll();

    $cutomer_data = $this->user_model->where('UserType',2)->findAll();

SELECT *
FROM `orders`
---

    $data['cutomer_count']=count($cutomer_data);

        $data['all_products'] = $this->order_modal->findAll();

SELECT *
FROM `orders`
SELECT *
FROM `orders`
ORDER BY `OrderID` DESC
 LIMIT 5
---

    $data['product_count'] = count($data['all_products']);

    $data['all_orders_count'] = $this->order_modal->findAll();
    $data['all_orders'] = $this->order_modal->orderBy('OrderID', 'DESC')->limit(5)->find();

SELECT *
FROM `users`
WHERE `UserID` = '83'
 LIMIT 1
SELECT *
FROM `orders`
WHERE `OrderID` = '280'
 LIMIT 1
---
        $OrderID = $single_trans_data['OrderID'];

        // Attempt to get user data if UserID is available
        $user_data = $user_id ? $this->user_model->where('UserID', $user_id)->first() : null;

        // Get order data regardless
        $order_data = $this->order_modal->where('OrderID', $OrderID)->first();

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE YEAR(Created_at) = '2025'
AND MONTH(Created_at) = 1
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE YEAR(Created_at) = '2025'
AND MONTH(Created_at) = 1
---
    public function get_chart_data()
{
    $uid = session()->get('user_id');

    // Check if a year is selected, otherwise set the current year as the default
    $year = $this->request->getPost('year');
    if (empty($year)) {
        $year = date('Y');  // Set to the current year if no year is selected
    }

    $orders_data_arr = [];
    $product_data_arr = [];
    $all_months = [];

    // Define the months
    $month = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sept', 'Oct', 'Nov', 'Dec'];

    // Loop through each month
    foreach ($month as $index => $month_data) {
        $all_months[] = $month_data;

        // Convert the month name to its corresponding month number
        $monthNumber = $index + 1; // For example, Jan = 1, Feb = 2, ...

        // Query to get the number of orders for each month in the selected year
        $ordersCount = $this->order_modal
            ->where('YEAR(Created_at)', $year)
            ->where('MONTH(Created_at)', $monthNumber)
            ->countAllResults();

        // Query to get the number of products for each month in the selected year
        $productsCount = $this->product_model
            ->where('YEAR(Created_at)', $year)
            ->where('MONTH(Created_at)', $monthNumber)
            ->countAllResults();

SELECT *
FROM `users`
WHERE `UserEmail` = 'admin@gmail.com'
AND `UserPassword` = 'e10adc3949ba59abbe56e057f20f883e'
AND `UserType` = 1
 LIMIT 1
---
    public function admin_login(){

        $session = session();

        $email = $this->request->getVar('email');
        $password = md5($this->request->getVar('password'));


        $data = $this->user_model->where('UserEmail', $email)->where('UserPassword',$password)->where('UserType',1)->first();