admin/app/Controllers/NotificationController.php

    public function index()
    {
        $ordermodel = new Ordermodel();

        $notifications = $ordermodel->where('is_read',0)->orderBy('Created_at', 'DESC')->findAll(5);
---
SELECT *
FROM `orders`
WHERE `is_read` = 0
ORDER BY `Created_at` DESC
 LIMIT 5