admin/app/Controllers/Payment.php

SELECT *
FROM `banners`
ORDER BY `BannerID` DESC
---
     public function all_banners()
    {
        $data['allbannersdata'] = $this->Banners->orderby('BannerID','desc')->findAll();