admin/app/Controllers/Products.php

SELECT *
FROM `products`
ORDER BY `ProductID` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT *
FROM `products`
ORDER BY `ProductID` DESC
---
    public function index()
    {
        // $data['product_data'] = $this->product->findAll();
         $search_data = $this->request->getVar('search_data');
        $product_name = $this->request->getVar('product_name');
        if(!empty($search_data) && empty($product_name))
        {
            $filter_data = $this->product->like('ProductShortDesc',$search_data)->orLike('ProductLongDesc',$search_data)->orderBy('ProductID', 'desc')->paginate(6);
        }
        else if(!empty($product_name) && empty($search_data))
        {
            $filter_data = $this->product->where('ProductName',$product_name)->orderBy('ProductID', 'desc')->paginate(6);
        }
        else if(!empty($search_data) && !empty($product_name))
        {
            $filter_data = $this->product->where('ProductName',$product_name)->like('ProductShortDesc',$search_data)->orLike('ProductLongDesc',$search_data)->orderBy('ProductID', 'desc')->paginate(6);
        }
        else
        {
            $filter_data = $this->product->orderBy('ProductID', 'DESC')->paginate(6);
        }

         $data = [
            'prdname'=>$product_name,
            'products'=>$this->product->orderBy('ProductID', 'DESC')->findAll(),

SELECT COUNT(*) AS `numrows`
FROM `products`
LEFT JOIN `categories` ON `products`.`CategoryID` = `categories`.`CategoryID`
SELECT `products`.*, `categories`.`CategoryName`
FROM `products`
LEFT JOIN `categories` ON `products`.`CategoryID` = `categories`.`CategoryID`
ORDER BY `ProductID` DESC
 LIMIT 12, 6
---
public function all_products()
{
    $searchData = $this->request->getVar('search_data');
    $productName = $this->request->getVar('product_name');
    $page = $this->request->getVar('page') ?: 1;

    // Load the product model
    $products_model = new \App\Models\ProductModel();

    // Initialize query builder with conditions based on filters
    $products_model->select('products.*, categories.CategoryName')
                  ->join('categories', 'products.CategoryID = categories.CategoryID', 'left')
                  ->orderBy('ProductID', 'DESC');

    // Apply search filters if provided
    if ($searchData) {
        $products_model->like('products.ProductName', $searchData);
    }
    if ($productName) {
        $products_model->like('products.ProductName', $productName);
    }

    // Paginate results (6 items per page)
    $products = $products_model->paginate(6, 'default', $page);

SELECT *
FROM `categories`
SELECT *
FROM `variation_type`
SELECT *
FROM `variation_value`
WHERE `VariationTypeID` = '15'
SELECT *
FROM `brands`
SELECT *
FROM `tags`
SELECT *
FROM `shipping_methods`
SELECT *
FROM `taxe_class`
---
    public function add_products()

    {
        $variationValueModel = new VariationValue();

        $data['categories'] = $this->catagory->findAll();
        $data['variation_type'] = $this->variationtype->findAll();
        foreach ($data['variation_type'] as $key => $variationType) {
            $variationTypeID = $variationType['VariationTypeID'];
            $variationValues = $variationValueModel->where('VariationTypeID', $variationTypeID)->findAll();
            $variationType['values'] = $variationValues;
            $data['variation_type'][$key] = $variationType;
            // Use the variation type and its associated values as needed
        }
        $data['variations'] = $this->optionvalue->findAll();
        $data['brands'] = $this->brand->findAll();
        $data['tags'] = $this->tags->findAll();
           $data['shipping_data'] = $this->shippingmethod->findAll();

          $data['tax_class']= $this->TaxesclassModel->findAll();

SELECT *
FROM `subcategory`
WHERE `category_id` = '23'
---
     public function get_sub_category(){
        $category_id = $this->request->getPost('category_id');
        $subcategories = $this->subcategory->where('category_id',$category_id)->findAll();

SELECT *
FROM `products`
WHERE `ProductID` = '14'
 LIMIT 1
---
    public function view_product_details($id)
    {
        $productdata= $this->product->where('ProductID',$id)->first();

SELECT *
FROM `subcategory`
WHERE `sub_category_id` = '71'
 LIMIT 1
---
        $data['categoryname']=$category_name;

        $subcategoryid=$productdata['SubCategoryID'];
        $subcategory_data=$this->subcategory->where('sub_category_id',$subcategoryid)->first();

SELECT *
FROM `variations`
WHERE `ProductID` = '14'
---
        // // print_r($variation_data); die;

        //  $product_id= 24;
        $variation_data= $this->variation->where('ProductID',$product_id)->findAll();

SELECT *
FROM `variation_type`
WHERE `VariationTypeID` IS NULL
 LIMIT 1
---
            $variation_disply_price=$single_data['VariationPrice'];
            $variation_disply_stock=$single_data['VariationStock'];

            $variationtype_name_data=$this->variationtype->where('VariationTypeID',$variationtypeid)->first();

SELECT *
FROM `categories`
ORDER BY `CategoryID` DESC
SELECT `subcategory`.`sub_category_id`, `subcategory`.`category_id`, `subcategory`.`sub_category`, `categories`.`CategoryID`, `categories`.`CategoryName`
FROM `subcategory`
JOIN `categories` ON `categories`.`CategoryID` = `subcategory`.`category_id`
ORDER BY `subcategory`.`sub_category_id` DESC
---
    public function all_subcategories()
    {
        $this->subcategory->select('subcategory.sub_category_id, subcategory.category_id, subcategory.sub_category, categories.CategoryID, categories.CategoryName');
        $this->subcategory->join('categories', 'categories.CategoryID = subcategory.category_id');
        $this->subcategory->orderBy('subcategory.sub_category_id', 'DESC'); // Order by sub_category_id in descending order

        $data['all_sub_catagories_data'] = $this->subcategory->get()->getResultArray();